Repository: Danpeo/DanilvarKanji
Catalog: DanilvarKanji.Client/Resources/App.*.resx
Languages: ru_ru

source: Language
ru_ru: Язык

source: NARUTO
ru_ru: Наруто

# NotEmptyCharDef
source: Please enter a definition
ru_ru: Пожалуйста введите определение

# ValueTooLong
source: The value must not exceed
ru_ru: Значение не может быть больше чем

# NotEmptyStrokeCount
source: Please enter stroke count
ru_ru: Пожалуйста введите количество штрихов

# NoMnemonics
source: A character should contain at least one mnemonic
ru_ru: Иероглиф должен содержать хотя бы одну мнемонику

# NoMeanings
source: A character should contain at least one meaning
ru_ru: Иероглиф должен содержать хотя бы одно значение

source: Not Found
ru_ru: Не найдено

# NothingAtAddress
source: Sorry, there's nothing at this address.
ru_ru: Извините, на этом адресе ничего не найдено.

# NotEmpty
source: Please enter a value
ru_ru: Пожалуйста введите значение

# InvalidEmail
source: Please enter valid email
ru_ru: Пожалуйста введите валидную электронную почту

# PasswordTooShort
source: Password too short, it should be at least
ru_ru: Пароль слишком короткий, должно быть хотя бы

# PasswordRequiresDigit
source: Password must have at least one digit ('0'-'9').
ru_ru: Пароль должен содержать хотя бы одну цифру

# PasswordRequiresUpper
source: Password must have at least one uppercase ('A'-'Z')
ru_ru: Пароль должен содержать хотя бы одну заглавую латинскую букву

# PasswordRequiresLower
source: Password must have at least one lowercase ('a'-'z')
ru_ru: Пароль должен содержать хотя бы одну строчную латинскую букву

# PasswordRequiresNonAlphanumeric
source: Password must have at least one non alphanumeric character
ru_ru: Пароль должен содержать хотя бы один специальный символ

# PasswordRepeatMismath
source: Passwords should be equal
ru_ru: Пароли должны совпадать

source: Log In
ru_ru: Войти

source: Register
ru_ru: Зарегестрироваться

source: Radical
ru_ru: Радикал

source: Kanji
ru_ru: Кандзи

# WhatIsMeaningFor
source: What is the meaning of
ru_ru: Какое значение у

# WhatIsKunyomiFor
source: What is the kun reading of
ru_ru: Какое кунное чтение у

# WhatIsOnyomiFor
source: What is the on reading of
ru_ru: Какое онное чтение у

# GoToReview
source: Go to the review?
ru_ru: Перейти к ревью?

source: Study is complete
ru_ru: Обучение окончено

# Fin
source: Finish
ru_ru: Завершить

# ValueTooSmall
source: The value must be greater than
ru_ru: Значение должно быть больше чем

source: Log Out
ru_ru: Выйти

source: Admin
ru_ru: Админинстратор

source: Dictionary
ru_ru: Словарь

# ExtractText
source: Text Extractor
ru_ru: Извлекатель текста

# AddNewChar
source: Add New Character
ru_ru: Добавить новый иероглиф

source: Flashcards
ru_ru: Флэш-карты

source: Settings
ru_ru: Настройки

source: My Learning
ru_ru: Мое изучение

# BackButton
source: BACK
ru_ru: НАЗАД

source: Reset
ru_ru: Сбросить

source: Authorization
ru_ru: Авторизация

source: Password
ru_ru: Пароль

source: Log in to your account
ru_ru: Войти в свой аккаунт

# AccountRegistered
source: Your account has been successfully registered!
ru_ru: Ваша учетная запись успешно зарегистрирована!

source: Registration
ru_ru: Регистрация

source: Register New Account
ru_ru: Зарегестрировать новый аккаунт

source: User Name
ru_ru: Имя пользователя

# LoggenIn
source: You have successfully logged into your account!
ru_ru: Вы успешно вошли в аккаунт!

# GenCreds
source: Generate Credentials
ru_ru: Сгенерировать учетные данные

# PasswordRepeat
source: Repeat the password
ru_ru: Повтор пароля

# ExtractTextTitle
source: Extract Japanese Text From Image
ru_ru: Извлечеть японский текст из изображения

source: OPEN IMAGE
ru_ru: ОТКРЫТЬ ИЗОБРАЖЕНИЕ

source: Horizontal
ru_ru: Горизонтальный

source: Vertical
ru_ru: Вертикальный

source: Canvas Size
ru_ru: Размер холста

source: Extract Text From
ru_ru: Извлечь текст из

source: Add New Collection
ru_ru: Добавить новую коллекцию

# ToView
source: View
ru_ru: Просмотреть

source: Review
ru_ru: Ревью

source: Delete
ru_ru: Удалить

source: Memorized
ru_ru: Выучено

source: Create
ru_ru: Создать

source: Remove Last
ru_ru: Удалить последний

source: Add
ru_ru: Добавить

source: Collection
ru_ru: Коллекция

source: Collection Name
ru_ru: Название коллекции

source: Users
ru_ru: Пользователи

source: Enter character definition
ru_ru: Введите определение иероглифа

source: For example
ru_ru: К примеру

source: Definition
ru_ru: Определение

source: Character Basic Details
ru_ru: Основная информация иероглифа

# CharacterBasicDetailsText
source: Character information common for all lanugages
ru_ru: Информация об иероглифа, общая для всех языков

# StrokeCount
source: Stroke Number
ru_ru: Количество штрихов

source: Character Type
ru_ru: Тип иероглифа

# NewToJapanese1
source: New to learning Japanese? Try
ru_ru: Только начали изучать японский? Попробуйте игру

# NewToJapanese2
source: an engaging adventure to master the basics of Japanese!
ru_ru: - это увлекательное приключение для освоения основ японского!

source: NIHONGO QUEST,
ru_ru: NIHONGO КВЕСТ

# DoYouRemember
source: Do You remember this?
ru_ru: Вы помните это?

source: FORGOT
ru_ru: НЕ ПОМНЮ

source: REMEMBER
ru_ru: ПОМНЮ

source: I REMEMBER IT PERFECTLY
ru_ru: Я ПОМНЮ ЭТО В ИДЕАЛЕ

source: Front
ru_ru: Фронт

# FlashcardBack
source: Back
ru_ru: Бэк

source: times in a row
ru_ru: раз подряд

source: Registration Date
ru_ru: Дата регистрации

source: Role
ru_ru: Роль

source: Action
ru_ru: Действие

source: Plain User
ru_ru: Простой пользователь

source: Super Admin
ru_ru: Супер-администратор

source: Japanese Writing
ru_ru: Японское написание

source: Update
ru_ru: Обновить

source: Search
ru_ru: Поиск

# DictionaryPlaceholder
source: Enter word by translation, kana or kanji...
ru_ru: Введите слово по переводу, кане или кандзи...

# CharacterSearchPlaceholder
source: Search characters by meaning, reading and definition...
ru_ru: Поиск иероглифа по значению, чтению и определению...

source: Confirm Email
ru_ru: Подтвердить Email

source: Show More
ru_ru: Показать еще
